# Books Project
- Robert Yonce
- 4/27/23

## ERD Image

 ![png](Books.png)

## Create Database

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:TARheels4@localhost/books"

In [2]:
engine = create_engine(connection_str)

### Imports of CSVs

In [4]:
import pandas as pd
books1 = pd.read_csv('users.csv')
books1.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [5]:
books1.to_sql('users', engine, if_exists = 'replace')

3

In [6]:
books2 = pd.read_csv('books.csv')
books2.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [7]:
books2.to_sql('books', engine, if_exists = 'replace')

6

In [8]:
books3 = pd.read_csv('authors.csv')
books3.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [9]:
books3.to_sql('authors', engine, if_exists = 'replace')

5

In [10]:
books4 = pd.read_csv('favs.csv')
books4.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [11]:
books4.to_sql('favs', engine, if_exists = 'replace')

7

## Testing Database

### Show Tables

In [12]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2            favs
3           users

In [15]:
q1 = """SELECT books.title, favs.user_id
FROM books
JOIN favs ON books.id = favs.book_id
WHERE favs.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""

pd.read_sql(q1, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1